{"index": "MMLU_physics_train_0", "question": "Under certain conditions, a beam of electrons impinging on a crystal surface will diffract and a scattering pattern of the beam can be obtained. What is the approximate kinetic energy of the electrons needed in order to see the pattern? (Assume the lattice spacing of the crystal to be 0.4 nm.),A)0.1 eV;B)1 eV;C)10 eV;D)100 eV. Which option is correct?", "groundtruth": "C", "task": "MMLU_physics"}
{"index": "MMLU_physics_train_1", "question": "Two identical satellites, A and B, are in circular orbits around Earth. The orbital radius of A is twice that of B. Which of the following gives the ratio of the angular momentum of A to the angular momentum of B?,A)4;B)2;C)sqrt(2);D)1/sqrt(2). Which option is correct?", "groundtruth": "C", "task": "MMLU_physics"}
{"index": "MMLU_physics_train_2", "question": "Positronium is an atom formed by an electron and a positron (antielectron). It is similar to the hydrogen atom, with the positron replacing the proton. If a positronium atom makes a transition from the state with n=3 to a state with n=1, the energy of the photon emitted in this transition is closest to,A)6.0 e;B)6.8 eV;C)12.2 eV;D)13.6 eV. Which option is correct?", "groundtruth": "A", "task": "MMLU_physics"}
{"index": "MMLU_physics_train_3", "question": "An astronomer observes a very small moon orbiting a planet and measures the moon’s minimum and maximum distances from the planet’s center and the moon’s maximum orbital speed. Which of the following CANNOT be calculated from these measurements?,A)Mass of the moon;B)Mass of the planet;C)Minimum speed of the moon;D)Period of the orbit. Which option is correct?", "groundtruth": "A", "task": "MMLU_physics"}
{"index": "MMLU_physics_train_4", "question": "A satellite of mass m orbits a planet of mass M in a circular orbit of radius R. The time required for one revolution is,A)independent of M;B)proportional to m^(1/2);C)linear in R;D)proportional to R^(3/2). Which option is correct?", "groundtruth": "D", "task": "MMLU_physics"}
